{"pages":[{"url":"http://blog.code4future.org/blog/pages/about/","tags":"misc","text":"Code4future 網誌 從小就學習程式的目的, 無非就是要這些未來的主人翁能夠及早了解數位系統的特性, 並且有效率地利用這些數位工具, 來解決類比世界所面臨的各種問題. 是的, 學習編程是要您用它來解決問題, 解決學習上的問題, 解決提升生活效能的問題, 解決單憑藉類比工具無法單獨解決的問題. 在華人世界推動兒童編程教學, 我們有兩個信念： 1. 編程的學習必須要能為其他的功課學習加分. 2. 任何有心推動類似活動的單位, 都能自由取得本站各種內容. 因為我們相信, 重要的事要能讓更多人參與. 您可以從 https://github.com/code4futuretw/blogsite 下載網站的內容. 這個倉儲的 gh-pages 分支, 就是 code4future.org 網站上的內容, 我們從 https://github.com/aroberge/reeborg 下載基本資料之後, 將原本無法直接在 Github pages 佈署的程式碼加以修改, 以便能夠讓兒童編程教學的推動者, 在沒有廣域網路連線的情況下來使用 Reeborg 機器人編程教學. code4fugure 在華人世界推動編程教學, 主要的服務對象有兒童 (6-18歲)、家長以及兒童的老師, 假如您已經熟悉 Git 與 Github 的用法, 您可以直接 git clone 本倉儲 gh-pages 分支的資料, 然後利用 Github Pages 的服務來建立網站, 也可以將倉儲 git clone 到近端電腦硬碟中, 只要操作系統中有 Python3 環境, 就可以透過 Python3 的 python -m http.server 指令, 在近端的區域網路伺服 Reeborg 機器人網站. 假如您對上面所提到的用法都不熟悉, 那麼, 我們將會在隨後, 加入對於有心推動兒童編程的家長與老師所需要的導引內容. 感謝您的到來, 希望編程教學的推廣可以讓更多的兒童及早進入數位世界, 發覺學習的樂趣, 創造更美好的未來.","title":"About"},{"url":"http://blog.code4future.org/blog/wo-men-ru-he-mian-dui-wang-zhan-bei-hai.html","tags":"社會人士","text":"是的, 我們週邊的幾個網站被駭了, 當用戶連結到這些網站, Google 趕忙提出警告, 讓用戶無法擷取網站的內容. 這幾個網站是採用 Wordpress 建立的, 使用 MySQL 資料庫, 架構在 OpenShift 雲端平台之上, 被駭入的時間點大約在這個月份中旬, 儘管如此, 我們並沒有丟失任何資料, 因為我們早就在等著這一天. OpenShift 雲端平台的使用或許簡單, 但是背後所運用的架構及流程相對複雜, 作為免費的 OpenShift 平台用戶, 我們沒有任何抱怨, 只在第1時間利用 Git 將平台上的資料 clone 到近端來分析, 試著想要找出那一個環節出了問題. 而在此之前, 我們的每一個網站資料內容都有動態與靜態等兩種格式, 大部分的內容都儘量保持同步, 而靜態的內容採用 Github Pages 與 Pelican 建置, 而且利用 Leo Editor 以程式方法加以管理, 在 Github 的倉儲下, 每一次提交推送版本都在遠端與近端各存一份, 而且還利用 git remote add, 放了另外一份同步的倉儲在 Bitbucket, 因此資料幾乎沒有丟失的可能. 好, 有了這樣萬全的準備, 我們還是想要知道, 駭客是如何攻陷這幾個網站的? git clone OpenShift 平台網站的資料到近端簡單分析一下, 問題出在 .openshift 中的啟動碼, 而且只有大約一年之前所建立的 application 受到影響, 過去幾個月建立的應用程式則沒有受到影響. 有了這樣的發現, 利用 git rm -rf *, 在版本資料中刪除所有的資料, 只留下 .git, 然後用最新的 OpenShift 平台上的 Wordpress 倉儲檔案, 重新提交推送到 OpenShift, 就這樣蓋掉被駭客入侵的舊檔案, 應該算是暫時解決了網站被駭的問題. 然後呢?就是等著下一次網站再次被駭!再救, 再設法解決問題, 報告完畢.","title":"我們如何面對網站被駭"},{"url":"http://blog.code4future.org/blog/wo-men-ren-zhi-zhong-de-suo-wei-gong-ye-40.html","tags":"社會人士","text":"當德國在幾年前喊出所謂的工業 4.0, 台灣似乎也跟著動了起來, 許多團隊都希望能夠與這個\"名詞\"沾上邊, 深怕沒有跟著喊, 好像就會很落伍一樣!? 在這裡, 就讓我們來談談自己認知中的所謂工業 4.0. 看看我們的周遭, 現在到底是個怎麼樣的環境? 您前面的這台桌上型電腦, CPU 型號是 Intel Core i7-5960X, 運算能力超過 300 GFlops, 大約等同 1996 年運算能力最快的超級電腦. 而您的網路對外連線速度為 10 Gbit/s, 每秒可以傳送大約 1 GByte 的資料, 而您所使用的 IPV6 網路協定, 其定址總數量, 可以讓整個地球所有物體的每一個原子都有一個以上的 IPV6 位址. 光是從一台桌上型電腦的高速運算能力, 加上高速網路連線, 再加上數量幾乎難以估算的 IPV6 網路位址, 再回頭來看看我們日常生活, 是否會覺得這三種遠遠超出我們目前需求或配置的利器, 其實大多數時間都閒置在一旁. 所以我們認知中的所謂工業 4.0, 其實只是一個概念, 就是要告訴您說, 假如您能夠充份運用上述的這三項數位利器, 再加上已經發展到奈米等級的各種感測器, 配上無所不在的機器深度學習或人工智慧, 那麼在萬事萬物充份連線, 積極將每一個環節都最佳化, 那樣的未來, 就是工業 4.0. 但是, 隨著 Windows 10 想要搭著這一波全球電子裝置全面整合的架構, 將原本屬於個人操控的電腦操作系統, 轉型為全時連線的網路服務來看, 人類生活全面進入所謂的工業 4.0 並非全然都是美好或美麗的新世界, 也可能是一個難以忍受的新 1984 世代, 人被機器綁架, 當然機器背後是這些貪婪無度, 想要藉著高度發展與整合的科技來操控用戶, 這絕對不是處於弱勢且毫無感知後果的用戶所樂見的. 因此 ,面對正在發展中的工業 4.0 概念, 未來將逐步從工廠擴散到每一個人的生活圈, 我們身為現代人, 無論從事那一種行業, 都必須對於這些數位運算技術有一定程度的了解與應用能力, 否則完全依賴所謂的高科技公司或團隊的打理下的軟硬體應用, 就好像買了一台網路無法斷線, 即時錄音錄影軟硬體無法關閉, 甚至永遠無法關機的電腦回家一樣可怕. 學習這些數位運算技術的底線, 古聖先賢早就說過了: 役物而不役於物!","title":"我們認知中的所謂工業 4.0"},{"url":"http://blog.code4future.org/blog/wo-men-ru-he-jian-li-zhe-ge-wang-zhan-san.html","tags":"社會人士","text":"在前兩篇文章中, 我們利用自己在 Godaddy 所購買的網域名稱, 配合 OpenShift 雲端平台, 建立了一個 http://demo.code4future.org 網站. 在這篇文章中, 我們將要加入 disqus 留言系統功能, 並且要利用 reCAPTCHA 來保護我們的帳號登錄流程, 減少被廣告商恣意利用程式方法入侵網誌系統. Step 1: 登入 Wordpress 網站. 由於 disqus 與 reCAPTCHA 的導入採用 Wordpress plugin 方法, 因此要導入的第1步就是登入我們已經建好的 Wordpress 網站: 登入後, 選擇 Plugins->Add New 表示要新增 Plugins: 首先利用 Disqus Comment System 作為關鍵字, 找出 Plugin, 然後安裝後 activate: 接著用 WordPress ReCaptcha Integration 作為關鍵字, 找出 Plugin, 也是安裝之後 activate: 接著設定 ReCaptcha plugin, 先點進 ReCaptcha, 然後在另外一個頁面, 登入 Gmail 帳號, 因為需要登入電子郵箱後取得設定用的 Site key 與 secret key, 以下為設定過程中的參考畫面: 接著設定 Disqus 留言系統, 先從 Plugins 頁面中的 Disqus Comment System 選擇其下的 Configure: 然後點選 Upgrade, 以配合隨後要加入的 Disqus 留言系統: 在 Install Disqus Comments 過程中, 需要註冊一個 Disqus 帳號, 若已經有 Disqus 帳號, 則在下圖中輸入 Disqus 帳號與密碼, 若尚未建立 Disqus 帳號, 則利用 dont have a Disqus Profile yet 申請: 如下圖所示, 可以用 Gmail 帳號登入, 以便串聯隨後要申請的 Disqus 帳號: 接著利用 Gmail 郵箱作為帳號, 輸入要作為 Disqus 帳號的密碼後, 就可以完成 Disqus 帳號建立: Disqus 帳號建立後登入, 可以利用滑鼠右鍵從 Disqus Home 頁面最右方的設定圖像, 帶出 Add Disqus to site 頁面: 接著將 Add Disqus to site 頁面拉到最底下的左方, 點選 Get Started: 接著註冊一個留言專用的 site name, 這裡使用了 demo_c4f_org 作為 site name, Wordpress 將會使用這個名稱當作留言系統的對應名稱: 接著按下同意使用條款後, 就可以回到 Wordpress 測試設定是否成功: 一旦使用者在 Disqus 註冊了留言系統後, 登入 Disqus 後, 就可以從 Home 頁面的 Admin 連結, 進入各 site name 的管理頁面: 接續前面 Wordpress Disqus Comment System plugin 的設定, 只要登入 Disqus, 就會出現下列畫面, 可以選擇要附加的留言 site name, 下圖只有一個 demo_c4f_org 可以選擇: 按下 Next, 就會出現 Disqua 留言系統已經設定完成: 另外, 如下圖所示, 在啟用 Disqus 之前, 必須用登錄的 Gmail 進行帳號驗證的動作, 才能開啟 Disqus 留言功能: 最後, 我們要修改 Awesomeone theme 主題中 slider 的標題, 說明文字與對應連結, 如下圖所示, 先進入 Appearance->Customize: 如下圖, 往下拉, 選擇 slider settings: 如下圖, 左側就是 Awesomeone theme 目前三張 sliders 的設定欄位, 可以依照實際需求修改: 結語 在這篇文章中, 我們承接前面兩篇文章建立 Wordpress 網誌, 加入兩個 plugins, 分別用來提升網誌留言系統的效能, 並且利用 reCAPTCHA plugin 來防止駭客利用程式方法擾亂我們所建立的網站, 最後還展示如何修改 Awesomeone theme 主題中的 Sliders 內容.","title":"我們如何建立這個網站 (三)"},{"url":"http://blog.code4future.org/blog/wo-men-ru-he-jian-li-zhe-ge-wang-zhan-er.html","tags":"社會人士","text":"在上一篇文章中, 我們介紹了如何利用 Gmail 郵箱在 OpenShift 雲端平台上登記免費的帳號, 如何在 OpenShift 建立 Wordpress 網站, 如何更改 theme 頁面主題, 而這個 OpenShift 平台上的 Wordpress 網站所使用的網址, 是由 OpenShift 提供, 主要是以使用者建立的應用程式名稱, 加上使用者所選的 namespace, 然後再疊上 rhcloud.com. 在這篇文章中, 我們將說明如何在 Godaddy DNS 設定中, 利用 www 當作主機代號, 疊上我們所購買的 domain name (也就是 code4future.org), 並且利用 DNS 架構中的 CNAME (別名) 將這個網址指到 OpenShift 的 Wordpress 網站, 最後再登入到 OpenShift 平台, 將原先 RedHat 附贈的網站名稱改為 Godaddy DNS 管理中所設定的網址名稱, 就可以完成使用我們所購買的 domain name 來跑 OpenShift 上的 Wordpress 網誌網站. 接下來的操作步驟, 目的就是要將第一篇我們已經完成的 Wordpress 網站網址, 對應為我們所購買的符號名稱, 也就是我們要將 wp-topuniversity.rhcloud.com 改為 demo.code4future.org. 這個設定, 總共牽涉到 3 個基本操作: Godaddy 帳號中的 DNS 管理. Wordpress 網站中的網址設定. OpenShift 平台上應用程式改用新的對應網址設定. 以實際操作流程為例, 我們在第 1 項 Godaddy 帳號中的 DNS 管理, 就是要利用 CNAME 設定, 將 demo.code4future 指向 wp-topuniversity.rhcloud.com. 而第 2 項 Wordpress 的設定, 就是要將原先建立應用程式時所選擇的網址 wp-topuniversity.rhcloud.com 改為 demo.code4future.org. 至於第 3 項則需要登入到 OpenShift, 進入 wp-topuniversity.rhcloud.com 應用程式的設定區, 把原先網站使用的 wp-topuniversity.rhcloud.com 改為 demo.code4future.org. Stpe 1: 首先必須登入 Godaddy. 登入後的畫面如下: 點選 Domains, 進入類似下列的畫面, 選擇要管理的 domains 名稱列, 點選其後的 Manage DNS 連結: 進入 DNS Management 畫面後, 可以看到 Records 右下方有一個 Add 按鈕: 這時要建立一個 Record Type 為 CNAME 的 DNS 紀錄, 因此在按下 Add 之前, 必須先從左下方的選單中, 選擇 CNAME: 按下 Add 之後, 必須分別在 CNAME 紀錄選單中的 Host 欄位與 Points to 欄位填上網站的名稱, 下列畫面的 Host 名稱, 填入 www, 表示要在 code4future.org 網域中 (請特別注意, Host 欄位中只需要填入 www 或 demo, 而不要填入 www.code4future.org 或 demo.code4future.org), 新增一個 Host 名稱為 www, 若再疊上網域, 網站名稱就成為 www.code4future.org, 假如在 Host 欄位填上 demo, 表示這個 CNAME 別名網站的網址就會是 demo.code4future.org. 至於 Points to 欄位, 表示這個 domain 網址別名要指向那一個網站, 在此案例中, 我們希望 demo.code4future.org 能夠指向 wp-topuniversity.rhcloud.com, 因此在 Points to 欄位中就必須填入 wp-topuniversity.rhcloud.com, 如下列畫面所示: 另外, 下列畫面中的 Host 雖然以 www 呈現, 但是我們在這裡的實際操作是讓 demo.code4future.org 指向 wp-topuniversity.rhcloud.com. 在上述 Godaddy 帳號中, 隸屬於我們所購買網址的 DNS Manage, 新增一筆 DNS CNAME 別名設定並存檔後, 假如我們這時以瀏覽器連結 http://demo.code4future.org, 就會出現下列錯誤的畫面: 目前以 demo.code4future.org 新的網址連結會產生錯誤, 主要原因在於, 雖然 Godaddy 中已經將 demo.code4future.org 以 DNS 別名設定指向 wp-topuniversity.rhcloud.com, 但是 Wordpress 中的網址仍然設為 wp-topuniversity.rhcloud.com. 因此接下來就要登入 wp-topuniversity.rhcloud.com 網站, 將應用程式的網址改為 demo.code4future.org. Step 2: 登入 Wordpress 網站, 請注意這個時候要利用第 1 篇所完成的 Wordpress 網址登入, 在這裡網站符號名稱為 wp-topuniversity.rhcloud.com, 登入前畫面如下: 登入 Wordpress 網站後的畫面如下: 接下來我們要進入 Settings->General 設定中, 點選畫面如下: 進入 General settings 後畫面如下, 這時可以看到 Wordpress 網誌所使用的網址為 wp-topuniversity.rhcloud.com. 下圖則顯示已經將原先使用的 wp-topuniversity.rhcloud.com 改為第 1 步 DNS 設定中所使用的 demo.code4future.org： 完成 Godaddy 的 DNS 設定, 並且將 Wordpress 原先使用的網址改為 demo.code4future.org, 整個網站仍無法正常運作, 因為 OpenShift 端仍然使用 wp-topuniversity.rhcloud.com 當作平台網站的符號名稱. 因此接著登入 OpenShift, 準備進行第 3 步網站名稱的修改. Step 3: 登入 OpenShift 後進入應用程式, 畫面如下: 進入要修改網址的應用程式連結後, 畫面如下, 這時點選 change, 表示要更改網站符號名稱: 按下 change 按鈕後, 在 Domain name 欄位中填入新網站名稱, 在此一案例中, 新網站名稱為 demo.code4future.org: 儲存新網站設定名稱後, 回到 OpenShift 應用程式設定畫面後, 網站名稱已經變成 demo.code4future.org 了. 假如上述的設定順利完成, 那麼恭喜您, 如下圖所示, 你的 Wordpress 網誌已經成功改用您所選定的網址, 在這個範例中 ,就是 http://demo.code4future.org . 總結 我們在第 1 篇說明中, 已經完成在 OpenShift 平台上建立一個 Wordpress 網站, 但是使用的是 rhcloud.com 的網址, 雖然 namespace 與應用程式名稱都可以自選, 但是我們可以利用上述的3個步驟設定, 以我們自己從 Godaddy 所購買的網域中的一個對應網址來跑 Wordpress 網誌, 因此我們總共進行了 3 個不同系統中的設定. 第 1 項設定是 Godaddy 帳號中的設定, 建立一個別名 (CNAME), 將 demo.code4future.org 指向 wp-topuniversity.rhcloud.com. 第 2 項設定則是 Wordpress 系統本身, 必須登入後在 Settings->General 中, 將運行 Wordpress 的網址, 從 wp-topuniversity.rhcloud.com 改為 demo.code4future.org, 總共有兩個欄位必須更改. 而第 3 項設定則是 OpenShift 平台中應用程式所採用的 domain name alias 修改, 將原先使用的 wp-topuniversity.rhcloud.com 改為 demo.code4future.org. 完成上述一連串設定後, 終於可以用自己選定的網址來執行 Wordpress 網誌了.","title":"我們如何建立這個網站 (二)"},{"url":"http://blog.code4future.org/blog/wo-men-ru-he-jian-li-zhe-ge-wang-zhan-yi.html","tags":"社會人士","text":"在這篇文章中, 我們將介紹 code4future 的網誌是如何建立的. 這幾天我們發現, 大約在一年之前利用 OpenShift 雲端平台所搭建的 Wordpress 網站, 幾乎全部都被駭客攻陷, 根據初步的了解, 駭客是從 OpenShift 雲端平台啟動的程式碼置入惡意軟體, 讓連結到這些網站的用戶, 被強迫指到一些惡意網站, 因此這些 Wordpress 網站在修復之前, 幾乎已經完全癱瘓, 已經無法正常運作. 在此希望我們這個網站不會有這樣的下場. 首先, 先來看看, 一個網站之所以能被使用者連結所需要的幾項元素: 網站符號名稱. 全球資訊網伺服器. 執行網誌功能的程式套件. 依附在網誌套件上的其他延伸功能套件. 以 code4future.org 網站來說, 這個網址是在 Godaddy 服務商購買的, 網址所對應的 DNS 設定也是交由 Godaddy 處理. 至於 code4future.org 網站的全球資訊伺服器採用 OpenShift 的雲端平台服務, 而 OpenShift 是建構在 RedHat 操作系統上, 而在雲端操作系統上, OpenShift 採用的全球伺服器是 Apache, 我們只要有一個能夠收信的電子郵箱, 就能夠在 OpenShift 雲端平台上登記帳號, 也能夠很快建立各種雲端伺服應用程式, 也就能夠使用 OpenShift 所提供的全球伺服器服務. 第 3 項, code4fugure.org 網站所使用的網誌是 Wordpress, 這是一套利用 PHP 程式語言所編寫的 Blog 套件, 至於與套件結合的資料庫, 則是採用 MySQL 系統. 至於第 4 項則是在 Wordpress 建立完成之後, 為了要延伸網誌的功能, 可以增加 Plugin 套件, 就 code4future.org 的網誌來說, 最重要的延伸功能就是將原先的留言系統改為 disqus 系統, 以方便使用者可以透過 disqus, gmail, facebook 或 twitter 等網站的帳號登入留言. 好了, 為了要在 OpenShift 建立一個 Wordpress 網站, 我們需要一個 Gmail 電子郵箱. Step 1: 登入到您的 Gmail 電子郵箱, 登入後將會在第 2 步完成 OpenShift 帳號登記後, 再回到 Gmail 來點按確認信連結. 說明: 因為當我們在 OpenShift 雲端平台登記帳號後, OpenShift 會寄出確認信, 我們必須回覆確認信後, 才能夠在 OpenShift 平台上建立全球資訊網應用程式. 以下為登入到 Gmail 的畫面: Step 2: 利用瀏覽器, 連結到 https://www.openshift.com/ , 然後利用步驟 1 的 Gmail 電子郵箱帳號, 登記一個 OpenShift 雲端平台帳號. 登記完成後, OpenShift 會以登記的 Gmail 帳號寄出確認信件, 使用者必須確認擁有所登記的電子郵箱後, 才能開始使用 OpenShift. 從下圖可以看到右上方 Sign up for free 的紅色連結: 下圖則為 Sign up OpenShift 帳號的畫面: 下圖則為登記 OpenShift 帳號後, 系統會寄出一封驗證電子郵箱擁有人的信件: Step 3: 當使用者完成 OpenShift 帳號登記的確認流程後, 就可以從 https://openshift.redhat.com/app/login , 以所登記的帳號密碼登入 OpenShift. 下圖則為登入 OpenShift 雲端平台後的畫面, 可以開始建立應用程式: Step 4: 當使用者登入 OpenShift 平台後, 就可以利用 Create your first application now 連結, 建立一個 Wordpress 4 的雲端網站. 當首次在 OpenShift 雲端平台上建立應用程式, 必須要選擇一個應用程式所屬的 namespace, 也就是 RedHat 用來建立網站網址的重要依據, 例如我們在這個範例中, 所選擇的 namespace 為 topuniversity, 因此隨後所建立的網站應用程式的網址都將以 topuniversity.rhcloud.com 作為網址符號名稱的後半段, 而前半段, 則是使用者所選擇的應用程式名稱, 例如我們選擇目前所建立的 OpenShift 雲端平台應用程式名稱為 wp, RedHat 就會將此應用程式的網址設為 wp-topuniversity.rhcloud.com 選擇好 namespace 與 application name 之後, 按下 Create Application, 就可以完成此一應用程式的建立. 從下圖可以看到建立應用程式時, 選擇建立 Wordpress 4 應用程式: 下圖則是設定 namespace 與應用程式名稱的畫面: 完成應用程式建立的畫面: Step 5: 當 OpenShift 雲端平台上的 Wordpress 應用程式建立完成後, 我們選擇 Visit app in the browser, 就可以開始在雲端安裝 Wordpress. 我們選擇以英文介面安裝, 接著輸入 Site Title, 以及網站管理者的帳號與密碼, 還有電子郵箱, 並註記是否要讓搜索引擎搜尋網站內容選項後, 按下 install Wordpress, 就可以開始進行安裝. 完成 Wordpress 應用程式建立後, 點選網站進入後, 可以開始安裝 Wordpress, 先選擇安裝的語系: 接著選擇網站名稱, 以及管理者的帳號密碼, 以及電子郵箱等: 安裝完成後, OpenShift 平台會傳回 Success 的畫面. 接著點下 login, 網站就會以 https 協定, 跳轉到 Wordpress 的登入畫面. 下圖則是成功完成 Wordpress 安裝的畫面: 恭喜您, 您已經在 OpenShift 雲端平台上建立了一個 Wordpress 網站, 以現在所建立的範例網誌為例 ,就是 http://wp-topuniversity.rhcloud.com 下圖則是登入畫面, 特別注意必須在 https 模式下才可以輸入帳號密碼: 下圖則已經以管理者身份登入 Wordpress: 下圖則是採用內建 theme 主題的 Wordpress 網站畫面: Step 6: 改用 awesomeone theme, 當以管理者身份登入 Wordpress 網站後, 選擇 Appearance->Themes, 然後選擇 Add new, 並且以 Awesomeone 關鍵字搜尋, 就可以找到 Awesomeone theme, 選擇 install 並 activate, 就可以改用 Awesome theme 主題了. 下圖可以看到, Wordpress 所採用的 default theme: 下圖顯示我們可以利用 add new theme, 安裝選用新的網站 theme 主題: 下圖顯示安裝並啟用 Awesomeone theme 主題: 最後完成啟用 Awesomeone theme 的 Wordpress 網站畫面: 總結 在這篇說明中, 我們利用 Gmail 帳號, 在 OpenShift 雲端平台登記了一個免費帳號, 並且利用這個免費帳號, 建立的一個 Wordpress 網站: https://wp-topuniversity.rhcloud.com/ , 這個網站使用了 Awesomeone theme, 但是除了內建的 plugin 外, 還沒有啟用其他 plugin, 在隨後的說明, 我們將說明如何將 OpenShift 所建立的網誌與 Godaddy 的網址對應, 而且還要說明如何在 Wordpress 網站中啟用 Disqus 留言系統.","title":"我們如何建立這個網站 (一)"},{"url":"http://blog.code4future.org/blog/wo-men-ru-he-li-yong-cheng-shi-fang-fa-jie-jue-zi-ji-de-wen-ti.html","tags":"社會人士","text":"在這篇文章中, 我們介紹如何利用 Python3 程式的特性與工具來解決我們在網誌發表上所面臨的問題. 一般在網路上發表網誌有動態與靜態等兩種選擇, 所謂動態網誌, 就是網誌系統直接在全球資訊網路上提供編修文章與管理的功能, 使用者可以直接利用全球資訊網瀏覽器, 以帳號登入網誌管理系統, 依照使用者權限管理內容. 動態網誌的好處就是即時而且靈活, 但是壞處則是資料的傳送必須透過全球資訊網程式處理後, 轉為 html 資料格式, 因此使用者擷取網誌內容的反應速度, 較事先已經轉成 html 的靜態網誌慢, 而另外一個壞處則是, 動態網誌將管理系統直接放在全球資訊網伺服器上, 儘管可以透過各種安全防護機制加以保護, 但是仍然帶有被駭客入侵修改內容的風險. 至於靜態網誌則是使用者利用各種方式編修網誌內容後, 將已經轉成 html 格式的內容送到全球資訊網伺服器, 而在 WWW 伺服器中並沒有提供任何用來管理網誌內容的程式, 因此好處是被擷取的反應速度較動態網誌快, 並且少掉被駭客入侵網誌管理系統的機會, 只有駭客攻破提供全球資訊網伺服器的雲端架構, 靜態網誌內容才可能受到破壞. 而靜態網誌的缺點則是無法像動態網誌一樣, 即時直接讓使用者在瀏覽器中編修文章內容. 了解動態網誌與靜態網誌的特性後, 一般使用者在建立網誌的過程中, 若希望能夠透過即時協同的方式, 多人共同管理網誌文章, 並且能夠有效保存各階段性的網誌文章內容. 大多採用動態網誌系統. 但是若想要利用類似 Github Pages 的架構, 利用分散式資料管理系統, 例如 GIT, 來管理每一個版本的內容, 則靜態網將會是比動態網誌更適合. 以 Code4Future 來說, 我們想要同時擁有上述動態與靜態網誌的優點, 但是又必須儘量讓兩個不同系統的內容能夠同步, 於是我們想出利用程式方法來媒合兩種風格迥異的網誌系統. 基本的作法如下： 我們其實是同時建立一個 Wordpress 靜態網誌系統與靜態的 Python3 Pelican 網誌系統. Wordpress 網誌系統的用法與一般動態網誌的管理模式相同, 可以讓負責協同的人員建立帳號, 依照帳號權限管理網誌內容. Python3 Pelican 的靜態網誌建立, 也採用一般靜態網誌的建立與上傳方法, 只是我們選擇利用 Github Pages 來伺服我們的靜態網誌. 結合 Wordpress 與 Pelican 網誌內容的基本技術植基於 XML-RPC 協定, 因為 Wordpress 是採用 PHP 程式語言編寫, 而 Pelican 則是採用 Python 程式語言, 假如沒有中繼的 XML-RPC 協定來轉換兩者的資料內容, 使用者就必須從 Wordpress 儲存資料的資料庫系統下手. 另外一個重要的程式架構則是, 我們選擇以 Leo Editor 來管理這個資料互動的程式流程. 由於從 Pelican 靜態網誌系統將資料轉進或轉出 Wordpress 時, 需要擁有管理資料的帳號密碼, 這時我們利用存在使用者電腦特定位置的帳號密碼讀取, 來登入 Wordpress 系統. 假如原始網誌內容先在 Wordpress 建立, 則位於 Leo Editor 專案中的 Pelican 靜態網誌管理系統可以利用 get-from-wp 按鈕將資料取回. 假如原始網誌內容先在 Pelican 建立, 則可以利用 Leo Editor 的 new-to-wp 按鈕, 將靜態網誌內容推向 Wordpress. 假如 Wordpress 網誌內容更動, 則 Pelican 可以再利用 get-from-wp 按鈕取回最新的資料. 假如位於 Pelican 管理系統中的網誌內容更動, 則可以利用 Leo Editor 的 edit-to-wp 按鈕將更新資料推向 Wordpress. 以下為實際的 Leo Editor 按鈕程式碼: new-to-wp-button 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 #coding: utf-8 import xmlrpc.client import datetime import os def get_cat_tag_content ( data ): # 請注意, 因為 data 來自 .md 的 body pan 內容, 第1行為 @language python # 用跳行符號分割 data_list = data . split ( \" \\n \" ) #第2行為 title title = data_list [ 1 ] #第3行為 category category = data_list [ 2 ] #第4行為 tags tags = data_list [ 3 ] # 有多項資料的 content 型別為數列 # 再將第7行之後的資料數列串回成以跳行隔開的資料 content = \" \\n \" . join ( data_list [ 6 :]) # 先將截斷摘要與內文的 pelican md 檔按符號, 換成 Wordpress 的 &lt;!-more-&gt; content = content . replace ( '&lt;!-- PELICAN_END_SUMMARY --&gt;' , '&lt;!--more--&gt;' ) # 接著若內容有 ~~~python 與 ~~~ 則換成 Wordpress 格式 content = content . replace ( '~~~python' , '[code lang=\"python\"]' ) content = content . replace ( '~~~' , '[/code]' ) return title , category , tags , content os . environ [ 'TZ' ] = 'Asia/Taipei' ################################# filepath = \"/home/amd/Desktop/www-code4future.txt\" wordpress = \"www.code4future.org\" fo = open ( filepath , \"r+\" ) data = [] for line in fo . readlines (): data . append ( line ) fo . close () # 從網誌節點的 parent().h 取得 wp_url # 從網誌節點的 parent().b 取得帳號與密碼對應的文字檔案路徑 wp_url = \"https://\" + wordpress + \"/xmlrpc.php\" wp_username = data [ 0 ] wp_password = data [ 1 ] ################################# wp_blogid = \"0\" status_draft = 0 status_published = 1 server = xmlrpc . client . ServerProxy ( wp_url ) # 從目前所在節點的 body pan 中取出類別, tags 以及文章內容 title_str , category_str , tags_str , content = get_cat_tag_content ( p . b ) # title 是一個單獨的字串 title = title_str . split ( \":\" )[ 1 ] # 指定時間出版 ''' date_created = xmlrpc.client.DateTime(datetime.datetime.strptime(\"2013-01-01 00:00\", \"%Y-%m-%d %H:%M\")) ''' # 以現在時間出版, 考慮與 Server 時間差八個小時 (480 分鐘), 因此要在 8 個小時前發表 date_created = xmlrpc . client . DateTime ( datetime . datetime . strptime (( datetime . datetime . now () - \\ datetime . timedelta ( minutes = 480 )) . strftime ( '%Y-%m- %d %H:%M' ), \"%Y-%m- %d %H:%M\" )) categories = [ category_str . split ( \":\" )[ 1 ]] # 請注意, 因為 tags 用逗點隔開, 因此必須透過 split() 再分開成為 list 資料 # 先用 : 斷開標投頭的 Tags:, 然後再透過逗點隔開, 將標註轉為數列資料 tags = tags_str . split ( \":\" )[ 1 ] . split ( \",\" ) data = { 'title' : title , 'description' : content , 'dateCreated' : date_created , 'categories' : categories , 'mt_keywords' : tags } post_id = server . metaWeblog . newPost ( wp_blogid , wp_username , wp_password , data , status_published ) # 利用最後的 child 節點來儲存 post_id to_save_post_id = p . insertAsLastChild () # 改為內文為空的節點, id 直接標在 head 標題 to_save_post_id . b = \"\" to_save_post_id . h = post_id # 因為新增節點, commander 必須 redraw c . redraw () g . es ( \"post_id 為\" , post_id ) g . es ( \"已經送出資料!\" ) edit-to-wp-button 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 #coding: utf-8 import xmlrpc.client import datetime import os def get_cat_tag_content ( data ): # 請注意, 因為 data 來自 .md 的 body pan 內容, 第1行為 @language python # 用跳行符號分割 data_list = data . split ( \" \\n \" ) #第2行為 title title = data_list [ 1 ] #第3行為 category category = data_list [ 2 ] #第4行為 tags tags = data_list [ 3 ] # 有多項資料的 content 型別為數列 # 再將第7行之後的資料數列串回成以跳行隔開的資料 content = \" \\n \" . join ( data_list [ 6 :]) # 先將截斷摘要與內文的 pelican md 檔按符號, 換成 Wordpress 的 &lt;!-more-&gt; content = content . replace ( '&lt;!-- PELICAN_END_SUMMARY --&gt;' , '&lt;!--more--&gt;' ) # 接著若內容有 ~~~python 與 ~~~ 則換成 Wordpress 格式 content = content . replace ( '~~~python' , '[code lang=\"python\"]' ) content = content . replace ( '~~~' , '[/code]' ) return title , category , tags , content os . environ [ 'TZ' ] = 'Asia/Taipei' ################################# filepath = \"/home/amd/Desktop/www-code4future.txt\" wordpress = \"www.code4future.org\" fo = open ( filepath , \"r+\" ) data = [] for line in fo . readlines (): data . append ( line ) fo . close () wp_url = \"https://\" + wordpress + \"/xmlrpc.php\" wp_username = data [ 0 ] wp_password = data [ 1 ] ################################# wp_blogid = \"0\" status_draft = 0 status_published = 1 server = xmlrpc . client . ServerProxy ( wp_url ) # 從目前所在節點的 body pan 中取出類別, tags 以及文章內容 title_str , category_str , tags_str , content = get_cat_tag_content ( p . b ) # title 是一個單獨的字串 title = title_str . split ( \":\" )[ 1 ] # 指定時間出版 ''' date_created = xmlrpc.client.DateTime(datetime.datetime.strptime(\"2013-01-01 00:00\", \"%Y-%m-%d %H:%M\")) ''' # 以現在時間出版, 考慮與 Server 時間差八個小時 (480 分鐘), 因此要在 8 個小時前發表 date_created = xmlrpc . client . DateTime ( datetime . datetime . strptime (( datetime . datetime . now () - \\ datetime . timedelta ( minutes = 480 )) . strftime ( '%Y-%m- %d %H:%M' ), \"%Y-%m- %d %H:%M\" )) categories = [ category_str . split ( \":\" )[ 1 ]] # 請注意, 因為 tags 用逗點隔開, 因此必須透過 split() 再分開成為 list 資料 tags = tags_str . split ( \":\" )[ 1 ] . split ( \",\" ) data = { 'title' : title , 'description' : content , 'dateCreated' : date_created , 'categories' : categories , 'mt_keywords' : tags } # 設法取得原 post 的 id origin_post = p . getLastChild () # 直接從標題取得 post 的 id 號碼 post_id = origin_post . h status = server . metaWeblog . editPost ( post_id , wp_username , wp_password , data , status_published ) if status : g . es ( \"資料已經更新!\" ) else : g . es ( \"有問題, 資料沒有更新!\" ) get-from-wp button 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 #coding: utf-8 import xmlrpc.client # 導入 html 模組, 使用 html.unescape 轉換 html 特殊符號 import html ################################# filepath = \"/home/amd/Desktop/www-code4future.txt\" wordpress = \"www.code4future.org\" fo = open ( filepath , \"r+\" ) data = [] for line in fo . readlines (): data . append ( line ) fo . close () # 從網誌節點的 parent().h 取得 wp_url # 從網誌節點的 parent().b 取得帳號與密碼對應的文字檔案路徑 wp_url = \"https://\" + wordpress + \"/xmlrpc.php\" wp_username = data [ 0 ] wp_password = data [ 1 ] ################################# server = xmlrpc . client . ServerProxy ( wp_url ) # 設法透過上述網誌網址, 帳號與密碼, 以及文章 id, 取回 categories, tags, 文章標題, 文章內容等資 # 從最後的 child 節點來取 post_id origin_post = p . getLastChild () post_id = origin_post . h # 取回與 post_id 對應的網誌文章內容 blog_content = server . metaWeblog . getPost ( post_id , wp_username , wp_password ) title = blog_content [ \"title\" ] # 這裡要利用 html.unescape 轉回特殊符號 description = html . unescape ( blog_content [ \"description\" ]) mt_text_more = html . unescape ( blog_content [ \"mt_text_more\" ]) if mt_text_more != \"\" : post_content = description + \" \\n &lt;!--more--&gt; \\n \" + mt_text_more else : post_content = description # 所取回的 categories 為 list categories = blog_content [ \"categories\" ] # 所取回的 tags 為以逗點隔開的字串 mt_keywords = blog_content [ \"mt_keywords\" ] # 取回文章作者 author = blog_content [ \"wp_author_display_name\" ] p . h = title categories_str = \"\" for category in categories : # 假如不是最後一個 if category != categories [ len ( categories ) - 1 ]: categories_str += category + \", \" else : # 這是最後一個 categories_str += category line1 = \"@language md \\n \" line2 = \"Title: \" + title + \" \\n \" line3 = \"Category: \" + categories_str + \" \\n \" line4 = \"Tags: \" + mt_keywords + \" \\n \" line5 = \"Author: \" + author + \" \\n @others \\n \" post_content = post_content . replace ( '&lt;!--more--&gt;' , ' \\n &lt;!-- PELICAN_END_SUMMARY --&gt; \\n ' ) post_content = post_content . replace ( '[code lang=\"python\"]' , '~~~python' ) post_content = post_content . replace ( '[/code]' , '~~~' ) p . b = line1 + line2 + line3 + line4 + line5 + post_content + \" \\n \" # 因為節點資料更新, commander 必須 redraw c . redraw () g . es ( \"資料已經取回\" )","title":"我們如何利用程式方法解決自己的問題"},{"url":"http://blog.code4future.org/blog/xue-xi-xie-dian-nao-cheng-shi-de-mu-de-yu-yi-yi.html","tags":"家長","text":"電腦編程的目的, 在能以客製隨選的方法解決問題, 而數位運算與思維的意義, 則希望從電腦的觀點提供解決方案. 程式 (program) 其實是一種流程規劃, 通常以精確定義的法則, 安排特定順序, 來產生特定的結果. 換言之, 學習寫程式可以與數位運算無關, 當然也就不一定要使用電腦. 但是數位運算的精確與快速, 帶來的體貼與便利性, 讓全世界各國開始希望其國民從小就能夠學習寫電腦程式, 因此學習寫電腦程式的目的在於: 讓學童在俱備高度彈性的數位世界裡學習, 透過影音多媒體的教材提高學習興趣. 讓學童及早接觸數位環境, 學習如何利用數位方法解決周遭的問題. 在數位世界裡, 最底層的運算單元雖然只有 0 與 1, 但是透過巧妙的安排, 可以利用單純且不易出錯的流程來進行數位運算, 可以利用相同的媒體來儲存各種不同的資料, 可以利用光速的方法來傳遞數據, 可以操控接近原子大小的精密製造流程來製造晶片, 可以利用演化與學習的模式來建立人工智慧. 這些相關技術與軟硬體產品的特性, 都是二十一世界各領域學生所必須儘早理解並掌握的知識. 以電腦網路協定來說, 目前主流的網路協定稱為 TCPIP, 早期使用的版本為第四版, 而目前正在推動的則為第六版, 以 IPV6 來說, 其網路位址的個數為 2 的 128 次方 (以冒號區隔, 共分八區, 每一區有 4 個十六進位的數字), 理論上足夠分配給整個地球每一個帶電原子各一個網路位址. 以電腦的運算能力來說, 目前的 64 位元個人電腦的運算能力比二十年前的超級電腦都強. 以感測器的製造能力來說, 隨著奈米技術的應用, 感測器愈做愈小, 而且單價愈來愈便宜. 以網路通信訊號的普及率來說, 在人類經常活動的區域範圍, 幾乎網路通信連線機制已經無所不在. 以實體產品的組裝與製造技術來說, 愈來有愈多的智慧型機器人被導入生產流程之中, 不僅取代煩雜的勞務人力工作, 而且已經俱備全球連線彈性客製的能力. 從以上的幾個面向來看, 及早學習寫電腦程式的目的, 就在於能讓學習者及早融入數位化運算充斥的未來環境, 而積極意義則在於, 希望這些未來學子能夠充份運用這些成熟的科技來改善環境, 有機會利用數位科技促進群體社會的永續發展.","title":"學習寫電腦程式的目的與意義"},{"url":"http://blog.code4future.org/blog/wei-xiao-hai-zhun-bei-yi-tai-dian-nao.html","tags":"家長","text":"是的, 您要為已經五歲的小孩準備一台電腦, 以下是我們的建議. 24吋螢幕的一台電腦總價格約為新台幣 7731 元. 體積龐大的桌上型電腦並非為小孩準備電腦的首選, 因為世界趨勢已經指向所謂的物聯網與工業 4.0, 可攜、低價並且能隨著孩童成長, 配合數位運算與機電控制\"自造\"學習的卡片型電腦才是正確的選擇. # 在台灣買樹莓派卡片電腦, 大約是台幣 1338 起跳 raspberrypi3 = 1338 # 有開關的 USB 式電源線, 可以從接上 110V 插座, 也可以從 電腦的 USB 插槽接電, 大約台幣 250 元 power = 250 # 內建 Noobs 的 32 GB 記憶卡, 賣價 400 元台幣 sdcard = 400 # 樹莓派的專用外殼, 要價台幣 275 元 case = 275 # 24 吋, 擁有 HDMI 接頭的螢幕, 大約台幣 4~5 千元 philips = 3988 # hdmi 接線, 130 元 hdmi = 130 # 微軟的鍵盤加上滑鼠, 最便宜的大約 590 元 microsoft = 590 # 耳機一副約 760 元 earphone = 760 try: g.es(raspberrypi3+power+sdcard+case+philips+hdmi+microsoft+earphone) except: print(raspberrypi3+power+sdcard+case+philips+hdmi+microsoft+earphone) #總價為新台幣: 7731 (201603) 卡片電腦: 要注意的是 2016 年2月起最新的是 64 位元內建 Wifi 的 Raspberry Pi 3, 在國外定價為美金 35 元, 在台灣大約 1338 元是最低價. 電源供應器: 最好買 USB 式的 5V2A 規格, 若正好在筆電或桌上型電腦旁邊使用, 可以透過 USB 接線供電. 含操作系統記憶卡(32GB): 32 GB 大概是目前最划算的規格, 記得買內建 Noobs 操作系統資料的版本. 電腦卡外殼: 螢幕: 記得要買支援 HDMI 接頭的電腦螢幕. HDMI 連接線: 可以買 1.4 到 2 米的 Raspberry Pi 專用連接線. 鍵盤與滑鼠: 建議買 Microsoft 最低價的型號即可 (我們的經驗是, 能夠標上 Microsoft 商標的電腦週邊硬體, 都是不錯的選擇). 耳機: 選擇單邊線而且可折疊的機型, 使用或收藏都比較方便.","title":"為小孩準備一台電腦"},{"url":"http://blog.code4future.org/blog/reeborg-ji-qi-ren-de-liang-ge-shi-jie.html","tags":"教師","text":"Reeborg 機器人世界是孩童學習 Python3 程式的一套有趣味性的工具, 從早期的單機程式, 到現在能夠直接在雲端主機或本地端進行練習操作, 正好見證了過去十幾年全球數位運算發展趨勢. 因為目前 Reeborg 機器人程式碼中同時存在 JavaScript 與 Brython: http://brython.info/ 語法, 而作者也不斷在這兩種語言中進行各種切換測試, 這裡先提供最近版本中的兩個機器人世界: http://code4futuredotorg.github.io/reeborg_tw/world.html ( Github 倉儲 ) http://code4futuredotorg.github.io/reeborg2/ ( Github 倉儲 ) 上面這兩個網站都是採用 Github Pages 技術 , 已經將原始程式碼中的絕對根目錄資料設定, 改為相對目錄, 因此也能夠在本地端利用 python3 -m http.server 的方式啟動.","title":"Reeborg 機器人的兩個世界"},{"url":"http://blog.code4future.org/blog/you-guan-she-hui-ren-shi-xue-xi-dian-nao.html","tags":"社會人士","text":"社會人士學習電腦的課題很廣, 我們只能提供較為基本的電腦使用功能與觀念的導引, 例如, 有關 Windows 與 Ubuntu 操作系統的取捨, 如何運用網路與網站來提升工作效率等. Code4Future 將與社會人士學習電腦的主題劃分為: 電腦基本軟硬體層次, 桌上型、筆記型與卡片型電腦的取捨, Windows 或 Ubuntu 操作系統? 基本的本地端網路協定、設定與應用 區域網路上的全球資訊網伺服器與雲端全球資訊網伺服器的應用 全球資訊網上, 免費學習電腦編程的網站: CodeCademy： https://www.codecademy.com/ FreeCodeCamp: https://www.freecodecamp.com/ Udemy: https://www.udemy.com/ Khanacademy: https://www.khanacademy.org/computing/computer-programming","title":"有關社會人士學習電腦"},{"url":"http://blog.code4future.org/blog/quan-yun-duan-dian-nao-fu-zhu-ji-jie-she-ji-3d-tao-jian.html","tags":"社會人士","text":"一般人對於所謂的電腦輔助機械設計繪圖套件, 可能都還停留在單機 ,必須安裝, 必須經過軟硬體授權認証才能啟動的單機應用程式. 自從 2015 年3月份開始, 一群曾經在 1993 協助打造全世界第一套個人電腦操作系統上的 MCAD (Mechanical Computer Aided Design) 團隊, 推出了 OnShape, 從此您又多了一個選擇, 可以在各種電腦裝置 (包括手機與平板電腦) 上設計繪製 3D 的零組件, 不僅能與多人進行即時協同設計, 並且可以從擁有 500MB 到 5GB 的免費帳號開始入門. 今天起, 請您暫時放下其他類似的 MCAD 套件, 開始關注: https://www.onshape.com/ . Your browser does not support the video tag. Your browser does not support the video tag. Your browser does not support the video tag.","title":"全雲端電腦輔助機械設計 3D 套件"},{"url":"http://blog.code4future.org/blog/shu-wei-yun-suan-bo-wu-guan.html","tags":"專題研究","text":"台灣是全世界重要的個人電腦生產國之一, 假如能夠有系統收集歷史上與數位運算相關的軟硬體相關資訊, 成立一個實體或虛擬的數位運算博物館, 那麼, 或許下一代年輕人能藉以鑑往知來, 在全球數位公民中扮演更重要的角色. 英國運算博物館 (National Museum of Computing): 電腦發展史: 電腦博物館 (Computer Museum): https://en.wikipedia.org/wiki/The_Computer_Museum,_Boston http://www.computerhistory.org/ http://tcm.computerhistory.org/ 從數位基礎到應用: http://www.nand2tetris.org/","title":"數位運算博物館"},{"url":"http://blog.code4future.org/blog/codeforlife-bian-cheng-tao-jian-jie-shao.html","tags":"K-12","text":"Code for Life https://www.codeforlife.education/ 是一套適合幼稚園到國小兒童使用的編程教育套件. Rapid Router 則是其中由英國 Ocado 公司在 2015 年 10 月份開源 釋出的全球資訊網套件 ( Rapid Router Github 倉儲 , Code for Life Twitter ), 採用 Javascript 與 Python 編寫, 並且架構在 Django 全球資訊網框架上. Rapid Router 從圖像編程入手, 規劃了適合 5-11 歲孩童電腦教學的教材, 並且逐步導入 Python 程式語法的教學, 其中的每一份教材都明確訂出進度與標的: http://storage.googleapis.com/codeforlife-assets/general_resources/introduction_to_coding.pdf . 同時, 老師註冊帳號後登入系統 ,就可以下載規劃完整的教學導引與學習評量內容, 儘管全部教材都是英文, 但若能夠藉由此份\"快車找路\"的類遊戲編程教學中, 讓孩童同時學習簡單的英文字句, 應該也是很不錯的額外收穫.","title":"CodeForLife 編程套件介紹"},{"url":"http://blog.code4future.org/blog/ru-he-jia-gou-yi-ge-dong-jing-jie-yi-de-wang-zhi-xi-tong.html","tags":"社會人士","text":"全球資訊網上有兩種基本的 Blog 架構, 動態的網誌以 Wordpress 為代表, 而靜態的網誌則以 Pelican 為例. 這一篇文章的目的, 在介紹 Code4Future 團隊如何利用 PHP、Python3, 在 OpenShift 雲端平台與 Github 版次管理系統中, 用同 Leo Editor 的專案架構, 以同一份內容, 幾乎同步地更新到動態與靜態的兩個網站. 首先, Code4Future 目前的動態網站為: http://www.code4future.org , 而靜態網站則位於 http://blog.code4future.org . 其中的動態網站採用 Openshift 雲端平台建構, 而靜態網頁則架構在 Github Pages 上. 從 https://github.com/code4futuretw/blogsite 倉儲, 可以取得 http://blog.code4future.org 靜態網誌上的所有資料 ,包括 Pelican 設定與 Leo Editor 專案檔中的所有按鈕指令程式碼. 首先來看, 如何在 OpenShift 建立一個 Wordpress 網誌: 到 https://www.openshift.com/ 申請一個帳號. 收到 OpenShift 信件後, 按回電子郵箱的確認連結, 就可以開始在 OpenShift 雲端平台上建立應用程式. 建立應用程式時, 選擇建立 Wordpress 類別的網誌, 並且選擇可用的網域名稱與應用程式名稱, 就可完成 Wordpress 起始設定. 當建立 Wordpress 應用程式完成後, 使用者即可進行網誌的設定, 其中包括管理者帳號的建立與基本網誌設定. 至於 Github Pages 上的 http://blog.code4future.org 靜態網誌, 其架構則比較複雜, 一方面, 我們採用 Leo Editor 來管理所有資料. 當使用者從 https://github.com/code4futuretw/blogsite 倉儲 git clone 資料到本地端之後, 必須依靠 Python3, PyQt, Pelican 與 Git 才能順利在本地端與 Github Page 分支端, 順利建立並管理這個靜態網誌系統. 此外, 我們建構靜態網頁系統的目的, 是希望爾後在實體課堂中推廣 Code4Future 的各階段教材時, 可以無需上到廣域網路, 利用隨身硬碟與區域網路就能夠上課. 因此 Github 倉儲中的 Pelican 系統又分為本地端與雲端平台上的轉檔設定. 使用本靜態網頁時, 基本工作流程如下: 從 https://github.com/code4futuretw/blogsite 倉儲, git clone 資料到本地端. 確定工作目錄中為倉儲的 gh-pages 分支內容. 利用 Leo Editor 5.1 以後的版本, 開啟 users 目錄下的 c4f.leo, 就可以看到本站的所有資料. 修改設定檔案內容. 根據網誌 md 檔案中的格式, 編寫新網誌文章. 先利用本地端所屬的 local-pelican 按鈕建立網誌文章. 本地端內容查詢無誤後, 再用 gh-pages-pelican 按鈕, 產升即將送到雲端上的 Pelican 網誌內容 至於將 Pelican 中的 .md 檔案內容, 送到 Wordpress, 則配合 new-to-wp-pelican, edit-to-wp-pelican 與 get-from-wp-pelican 等3個按鈕指令.","title":"如何架構一個動靜皆宜的網誌系統"},{"url":"http://blog.code4future.org/blog/you-guan-xue-tong-dian-nao-jiao-xue.html","tags":"教師","text":"數位運算裝置融入各種教學的趨勢已經不可避免, 身為幼稚園到國小的教師, 可以利用現有的優秀教材來推廣學童電腦教學. 這裡先介紹來自台灣, 兩個很棒的線上教材: 均一教育平台: http://www.junyiacademy.org/ 橘子蘋果程式設計學苑: https://orangeapple.co/ 均一平台上的電腦課程: Scratch: http://www.junyiacademy.org/root/isc Javascript: http://www.junyiacademy.org/root/ijs 一小時玩程式: http://www.junyiacademy.org/computer-science-a/ihc 數學式與 LaTeX: http://www.junyiacademy.org/computer-science-a/i5t 橘子蘋果開放教材: https://orangeapple.co/csr/open-material 最後則介紹來自美國哈佛大學的 Scratch 開放教材: http://scratched.gse.harvard.edu/guide/","title":"有關學童電腦教學"},{"url":"http://blog.code4future.org/blog/jia-chang-ru-he-zhi-ding-wang-lu-shi-yong-zheng-ce.html","tags":"家長","text":"無論您從事那一個行業, 週遭一定充滿了各種網路與大小電腦的應用, 從大樓的門禁開始, 電梯、飲水機, 更不用提許多人辦公地點幾乎都各有一台桌上型或筆記型的個人電腦, 透過無線或有線網路與各種資訊系統或網站相連, 未來, 有關網路與電腦的各種應用, 更會密切涉入現代人的生活. 因此, 身為家長的您, 除了必須體認到未來的現代國民已經離不開網路與電腦之外, 必須了解目前全世界有關網路內容分級, 都是採取軟性的自我管制模式, 所以各位家長必須自己在家裡, 嚴格制定未成年兒童的網路使用政策. 我們的認知: 未成年兒童, 不應該獨自使用公共網路, 更不應該在沒有家長的管制下, 上網交友. 根據 Facebook 的規定 13 歲以上 才能建立帳號, 也就是 grade 7, 國中之後的年輕人才能夠使用臉書, 所以身為家長, 必須限制國小學童在家自由使用網路與電腦 (包括手機) 的權力, 假如配合學校功課的要求, 13 歲之前的孩童, 最好是在家長的陪同下使用廣域網路與電腦.","title":"家長如何制定網路使用政策"},{"url":"http://blog.code4future.org/blog/wei-shi-mo-da-jia-du-yao-ni-xue-dian-nao.html","tags":"K-12","text":"學電腦?學習寫程式?然後呢? 學電腦是一個非常廣的題目, 因為電腦原來的意思是計算器, 現在的計算器到處都是, 從冷氣的溫度控制到手機, 都是不同等級的電腦. 所以嚴格來說, 與電腦有關的學習是學不完的, 當全世界許多現代人都已經離不開電腦的時候, 所謂的學電腦, 應該是指: 了解電腦的基本軟體與硬體運作原理 了解電腦的基本操作方法 了解如何操控電腦, 並且用電腦來協助解決問題 接著來回答, 為什麼大家都叫你學電腦?最主要的原因就是, 現代人無論從事那一個行業, 都需要依賴電腦來解決問題, 所以假如學生能夠從小就知道什麼叫作數位運算, 有那些特性, 與現實世界的運作有那些關聯, 學習如何利用電腦來增加工作效率, 那麼才能在父母與老師的協助下, 真正發揮電腦的功用. 這一篇文章的類別是: K-12, K 指的是幼稚園的學生, 也就是五歲到六歲的孩童, 我們當然不是寫文章給幼稚園的小朋友看的, 但這裡指的 12, 就是 12 年國教的學生, 從小學一年級開始到高中畢業, 總共 12 年, 假如你是國小高年級以上的學生, 已經可以利用 Code4future 網站上的資料, 進行自學, 但是我們並不鼓勵你們這樣做, 因為你們還沒有成年, 也就是還沒有滿十八歲, 根據我們的經驗, 未成年的學生是不允許獨自上網的, 希望能夠在家長或老師的指導下, 下載 Code4future 上的教案資料, 可以在沒有外部網路 (也稱為廣域網路) 的單機或內部網路上執行. 我們特別鼓勵過去以為學電腦就是玩遊戲的國小高年級學生, 能夠在家長與老師的協助下, 儘早學習利用電腦來解決問題的訣竅, 讓你可以更加了解學習的樂趣, 並且有效率地學習其他學科, 以便空出更多時間發展個人技藝或專長. 這裡要介紹的電腦程式學習課程之一是 Reeborg 機器人: http://reeborg.ca/world.html , 假如你用瀏覽器打開這個頁面之後, 完全看不懂其中的英文字與說明段落, 我們希望你不要用翻譯軟體來看這些資料, 因為我們要告訴你, 想學好電腦, 英文能力是必備條件, 而且基本的數學能力也是有效運用電腦的另一個必要條件, 所以不要以為只要學會使用電腦, 就可以丟開其他課本, 正確的學習電腦觀念是: 未成年學生不要獨自上網, 因為網路上沒有用的東西比有用的資料, 多了許多, 你要在老師與家長的安排之下才能使用電腦與網路. 電腦與數學及英文, 或者其他各種學科, 都有很密切的關聯, 學習電腦是要讓你的學習更有效率, 及早掌握現代人協同合作的方式. 學習電腦的主要目的在解決問題, 這些問題當然包括用有效率的方式來提供使用者遊戲或運動或玩樂. 最後, 我們再次提醒你, 為什麼大家都叫你學電腦? 因為我們希望你未來能夠快速融入國際社會, 利用電腦解決各種問題, 做一個有用的青年, 造福社會!","title":"為什麼大家都要你學電腦?"},{"url":"http://blog.code4future.org/blog/code4future-user-wen-zhang-tao-gao.html","tags":"專題研究","text":"這裡可以放入文章的摘要內容 文章標題 這裡開始文章內容 文章內放入超文件的連結: http://code4future.org 文章子標題 文章內放入圖片: 引入程式碼 1 2 3 4 5 6 7 8 9 10 import math # Pythagoras Theorem def hypotenuse ( side1 , side2 ): return math . sqrt ( math . pow ( side1 , 2 ) + math . pow ( side2 , 2 )) side1 = 3 side2 = 4 h = hypotenuse ( side1 , side2 ) print ( a right triangle with side1 = \", side1, \" and side2 = \", side2, \" the hypotenuse is : \", h)","title":"Code4future user 文章套稿"}]}